Repository: MBasemBahman/DiamondLockers
Catalog: Site/Resources/ResourcesFile.*.resx
Languages: ar

source: 2 years warranty
ar: ضمان عامين

source: 24 / 7 lockers at your service
ar: 24/7 الخزائن في خدمتك

source: About Us
ar: عن دايموند لوكرز

source: After Sale Service
ar: خدمات ما بعد البيع

source: Airports
ar: المطارات

source: All
ar: الكل

source: Apartment Buildings
ar: الشقق السكنية

source: AVAILABILITY
ar: الخدمة

source: Beige
ar: بيج

source: Black
ar: أسود

source: Blue
ar: أزرق

source: Brown
ar: بني

source: Business usage includes:
ar: على سبيل المثال:

source: Buy
ar: شراء

source: Companies
ar: شركات

source: Contact Us
ar: إتصل بنا

source: Contact us today. Let us help you better manage your security, storage, and data.
ar: اتصل بنا اليوم. لنساعدك فى تحسين إدارة أماناتك.

source: Contact us today. Let us help you better manage your security.
ar: اتصل بنا اليوم. لنساعدك فى تحسين إدارة أماناتك.

source: Copyright. All Rights Reserved
ar: حقوق النشر. كل الحقوق محفوظة

source: COST REDUCTION
ar: تكلفة أقل

source: Culture
ar: EN

source: CultureState
ar: ar

source: CultureVal
ar: en

source: Dark Gray
ar: رمادي داكن

source: Delivery to your location
ar: توصيل إلى موقعك

source: Diamond Lockers
ar: دايموند لوكرز

source: Diamond Lockers allows you to keep reliable cloud-based records with multiple data options. Options include what is stored, who has access, and when to permit access.
ar: تستطيع فى دايموند لوكرز عن طريق عدة اختيارات تخص البيانات أن تحتفظ بالسجلات الموثقة للبيانات فى قاعدة البيانات الالكترونية. وتتمثل الاختبارات فى ما هو الشيئ الذي تم تخزينة, ومن يصل إليه, ومتى يسمح بالوصول إليه.

source: E-Mail
ar: الإيميل

source: Email
ar: الإيميل

source: Enquiry
ar: استفسار

source: Features
ar: الخصائص

source: Filter by category
ar: النوع

source: Filter by color
ar: اللون

source: Filter by size
ar: الحجم

source: font
ar: Cairo

source: Get in touch
ar: تواصل معنا

source: Government Institutions
ar: المؤسسات الخكومية

source: Green
ar: أخضر

source: Guaranteed Safe &amp; Secured
ar: أمان وحماية مضمونة

source: Home
ar: الرئيسيه

source: If anything (non-consumable) goes wrong, we will cover your loss
ar: في حال حدوث خلل تصنيع, فنحن متكفلون بتعويضك

source: Individuals
ar: أفراد

source: Installation
ar: التركيب والتشغيل

source: Integrated camera surveillance as needed
ar: كاميرات مراقبة متكاملة حسب الطلب

source: Intelligent lockers are hygienic and clean
ar: الخزائن الذكية صحية ونظيفة

source: learn More
ar: للمزيد

source: Light Gray
ar: رمادي فاتح

source: Maintenance
ar: الصيانة

source: Message
ar: الرسالة

source: Message sent successfully!
ar: تم ارسال الرسالة بنجاح!

source: Mission
ar: مهمتنا

source: Name
ar: الاسم

source: Non-contact
ar: بدون تلامس

source: Offices
ar: المكاتب

source: Orange
ar: برتقالي

source: Our Office Location
ar: المقر الرئيسي

source: Our team will be glad to support you with this decision
ar: سنكون سعداء بمساعدتك على اتخاذ القرار

source: Parcel locker control unit
ar: وحدة تحكم في خزائن الطرود

source: Parcel locker sets
ar: مجموعة لخزائن الطرود

source: Parcel Lockers
ar: خزائن الطرود

source: Parcel Pickup and Delivery
ar: أماكن استلام الطرود

source: Parcel tower
ar: برج الطرود

source: Phone
ar: التليفون

source: Please complete the form!
ar: يرجى ملء النموذج!

source: Products
ar: المنتجات

source: Recreation Centers
ar: مراكز الترفية

source: Red
ar: أحمر

source: Refrigerated locker
ar: الخزائن المبردة

source: Rent
ar: إيجار

source: Rent or Buy?
ar: إيجار أم شراء؟

source: Riyadh
ar: الرياض

source: Safety
ar: الحماية

source: Saudi Arabia
ar: المملكة العربية السعودية

source: Service
ar: الخدمه

source: Services
ar: الخدمات

source: Shopping Malls
ar: المول

source: Smart Lockers
ar: الخزائن الذكية

source: Smart lockers, Smart storage, e lockers, storage alternatives, office storage solutions, what is a smart locker, face recognition locker, touchless lockers, digital locker, smart locker companies ,locker technology
ar: الخزائن الذكية, التخزين الذكي, خزائن الكترونية, بدائل للتخزين, حلول تخزين للمكتب, ما هي الخزنة الذكية؟, خزائن ببصمة الوجه, خزائن بدون لمس, الخزتة الرقمية, شركات الخزائن الذكية, تكنولوجيا الخزائن, نظام التخزين الذكي

source: Something wrong please try again!
ar: خطأ ما الرجاء المحاولة مرة أخرى!

source: Spare parts
ar: توفير قطع الغيار

source: Staff training
ar: التدريب على طريقة الإستخدام

source: Streamlined operations and better access control make Diamond Lockers 1st for intelligent locker storage management in Saudi Arabia
ar: تعتبر الخزنة الذكية مساحة تخزين آمنة باستخدام تقنية مبتكرة لجعلك تدير خزتك بانسيابية وبشكل أوتوماتيكياً. هل مازلت تستخدم الخزائن التقليدية المستهلكة للوقت؟ قد يكون حان الوقت لتحسين خزائنك لخزائن دايموند لوكرز.

source: Submit
ar: ارسال

source: Supermarkets
ar: السوبر ماركت

source: To be Saudi Arabia's number-one choice for innovation in intelligent storage locker solutions.
ar: نكون الاختيار الأول فى المملكة العربية السعودية لحلول الخزائن الذكية.

source: To offer accessible, safe, and efficient state-of-the-art technology without compromising customer service.
ar: نقدم خزائن تتميز بسهولة الاستخدام والأمان والتقنية التكنولوجية الحديثة.

source: Turquoise
ar: تركواز

source: Type
ar: النوع

source: Universities
ar: الجامعات

source: Unneeded human presence
ar: لا حاجة لوجود موظف إضافي

source: Vision
ar: رؤيتنا

source: White
ar: أبيض

source: Yellow
ar: أصفر

source: Your Email
ar: إيميلك

source: Your Name
ar: اسمك

source: Your Phone
ar: رقم تليفونك
